avr-rust/avrd/packs/xmegac/ATxmega192C3.atdf
          </instance>
        </module>
        <module name="MCU" id="I6091" version="XMEGAD">
          <instance name="MCU">
            <register-group address-space="data" offset="0x0090" name-in-module="MCU" name="MCU"/>
          </instance>
        </module>
        <module name="PMIC" id="I6057">
          <instance name="PMIC">
            <register-group address-space="data" offset="0x00A0" name-in-module="PMIC" name="PMIC"/>
          </instance>
        </module>
        <module name="PORTCFG" id="I6075" version="XMEGAD">
          <instance name="PORTCFG">
            <register-group address-space="data" offset="0x00B0" name-in-module="PORTCFG" name="PORTCFG"/>
          </instance>
        </module>
        <module name="CRC" id="I6111" version="XMEGAD">
          <instance name="CRC">
            <register-group address-space="data" offset="0x0D0" name-in-module="CRC" name="CRC"/>
          </instance>
        </module>
        <module name="EVSYS" id="I6061" version="XMEGAC">
          <instance name="EVSYS">
            <register-group address-space="data" offset="0x0180" name-in-module="EVSYS" name="EVSYS"/>
          </instance>
        </module>
        <module name="NVM" id="I6076" version="XMEGAAU">
          <instance name="NVM">
            <register-group address-space="data" offset="0x01C0" name-in-module="NVM" name="NVM"/>
          </instance>
        </module>
        <module name="ADC" id="I6110">
          <instance name="ADCA">
            <register-group address-space="data" offset="0x0200" name-in-module="ADC" name="ADCA"/>
          </instance>
        </module>
        <module name="AC" id="I6077" version="XMEGAD">
          <instance name="ACA">
            <register-group address-space="data" offset="0x0380" name-in-module="AC" name="ACA"/>
          </instance>
        </module>
        <module name="RTC" id="I6093">
          <instance name="RTC">
            <register-group address-space="data" offset="0x0400" name-in-module="RTC" name="RTC"/>
          </instance>
        </module>
        <module name="TWI" id="I6089" version="XMEGAAU">
          <instance name="TWIC">
            <register-group address-space="data" offset="0x480" name-in-module="TWI" name="TWIC"/>
          </instance>
          <instance name="TWIE">
            <register-group address-space="data" offset="0x4A0" name-in-module="TWI" name="TWIE"/>
          </instance>
        </module>
        <module name="USB" id="I3005" version="XMEGAAU">
          <instance name="USB">
            <register-group address-space="data" offset="0x4C0" name-in-module="USB" name="USB"/>
          </instance>
        </module>
        <module name="PORT" id="I6075" version="XMEGAAU">
          <instance name="PORTA">
            <register-group address-space="data" offset="0x0600" name-in-module="PORT" name="PORTA"/>
          </instance>
          <instance name="PORTB">
            <register-group address-space="data" offset="0x0620" name-in-module="PORT" name="PORTB"/>
          </instance>
          <instance name="PORTC">
            <register-group address-space="data" offset="0x0640" name-in-module="PORT" name="PORTC"/>
          </instance>
          <instance name="PORTD">
            <register-group address-space="data" offset="0x0660" name-in-module="PORT" name="PORTD"/>
          </instance>
          <instance name="PORTE">
            <register-group address-space="data" offset="0x0680" name-in-module="PORT" name="PORTE"/>
          </instance>
          <instance name="PORTF">
            <register-group address-space="data" offset="0x06A0" name-in-module="PORT" name="PORTF"/>
          </instance>
          <instance name="PORTR">
            <register-group address-space="data" offset="0x07E0" name-in-module="PORT" name="PORTR"/>
          </instance>
        </module>
        <module name="TC" id="I6090" version="XMEGAD">
          <instance name="TCC0">
            <register-group address-space="data" offset="0x800" name-in-module="TC0" name="TCC0"/>
          </instance>
          <instance name="TCC1">
            <register-group address-space="data" offset="0x840" name-in-module="TC1" name="TCC1"/>
          </instance>
          <instance name="TCD0">
            <register-group address-space="data" offset="0x900" name-in-module="TC0" name="TCD0"/>
          </instance>
          <instance name="TCE0">
            <register-group address-space="data" offset="0xA00" name-in-module="TC0" name="TCE0"/>
          </instance>
          <instance name="TCF0">
            <register-group address-space="data" offset="0xB00" name-in-module="TC0" name="TCF0"/>
          </instance>
        </module>
        <module name="TC2" id="I6090" version="XMEGAD">
          <instance name="TCC2">
            <register-group address-space="data" offset="0x800" name-in-module="TC2" name="TCC2"/>
          </instance>
          <instance name="TCD2">
            <register-group address-space="data" offset="0x900" name-in-module="TC2" name="TCD2"/>
          </instance>
          <instance name="TCE2">
            <register-group address-space="data" offset="0xA00" name-in-module="TC2" name="TCE2"/>
          </instance>
          <instance name="TCF2">
            <register-group address-space="data" offset="0xB00" name-in-module="TC2" name="TCF2"/>
          </instance>
        </module>
        <module name="AWEX" id="I6090" version="XMEGAAU">
          <instance name="AWEXC">
            <register-group address-space="data" offset="0x880" name-in-module="AWEX" name="AWEXC"/>
          </instance>
        </module>
        <module name="HIRES" id="I6090" version="XMEGAAU">
          <instance name="HIRESC">
            <register-group address-space="data" offset="0x890" name-in-module="HIRES" name="HIRESC"/>
          </instance>
        </module>
        <module name="USART" id="I6090" version="XMEGAAU">
          <instance name="USARTC0">
            <register-group address-space="data" offset="0x8A0" name-in-module="USART" name="USARTC0"/>
